HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD_1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD_1_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD_1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD_1_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD_2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD_2_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD_2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD_2_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD_2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD_2_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2a */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2a */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2a */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2b */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2b */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2b */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2c */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2c */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2c */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2d */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2d */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2d */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_OFF (24)

/** \\brief  Length for Ifx_GTM_DPLL_APS_1c3_Bits.APS_1c3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_1c3_Bits.APS_1c3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_1c3_Bits.APS_1c3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.APS_1c2 */
#define IFX_GTM_DPLL_APS_APS_1C2_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.APS_1c2 */
#define IFX_GTM_DPLL_APS_APS_1C2_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.APS_1c2 */
#define IFX_GTM_DPLL_APS_APS_1C2_OFF (14)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_ext */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_ext */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_ext */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_old */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_old */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_old */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_OFF (14)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_status */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_status */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1c2_status */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.WAPS_1c2 */
#define IFX_GTM_DPLL_APS_WAPS_1C2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.WAPS_1c2 */
#define IFX_GTM_DPLL_APS_WAPS_1C2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.WAPS_1c2 */
#define IFX_GTM_DPLL_APS_WAPS_1C2_OFF (13)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.WAPS */
#define IFX_GTM_DPLL_APS_WAPS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.WAPS */
#define IFX_GTM_DPLL_APS_WAPS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.WAPS */
#define IFX_GTM_DPLL_APS_WAPS_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_APT_2c_Bits.APT_2c */
#define IFX_GTM_DPLL_APT_2C_APT_2C_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_2c_Bits.APT_2c */
#define IFX_GTM_DPLL_APT_2C_APT_2C_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_2c_Bits.APT_2c */
#define IFX_GTM_DPLL_APT_2C_APT_2C_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_APT_Bits.APT_2b */
#define IFX_GTM_DPLL_APT_APT_2B_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_Bits.APT_2b */
#define IFX_GTM_DPLL_APT_APT_2B_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_Bits.APT_2b */
#define IFX_GTM_DPLL_APT_APT_2B_OFF (14)

/** \\brief  Length for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_ext */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_ext */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_ext */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_old */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_old */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_old */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_OFF (14)

