HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_status */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_status */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2b_status */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_APT_Bits.WAPT_2b */
#define IFX_GTM_DPLL_APT_WAPT_2B_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_Bits.WAPT_2b */
#define IFX_GTM_DPLL_APT_WAPT_2B_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_Bits.WAPT_2b */
#define IFX_GTM_DPLL_APT_WAPT_2B_OFF (13)

/** \\brief  Length for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_OFF (3)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DEN */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DEN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DEN */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DEN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DEN */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DEN_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_OFF (9)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_OFF (7)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_OFF (4)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_OFF (5)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SMC */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SMC_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SMC */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SMC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SMC */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SMC_OFF (27)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SSL */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SSL_LEN (2)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SSL */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SSL_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SSL */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SSL_OFF (28)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SWR */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SWR_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SWR */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SWR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SWR */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SWR_OFF (23)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NT_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NT_MSK (0x1f)

