HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NT_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYSF */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYSF_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYSF */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYSF_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYSF */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYSF_OFF (24)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TS0_HRS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TS0_HRS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TS0_HRS_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TS0_HRT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TS0_HRT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TS0_HRT_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TSL */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TSL_LEN (2)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TSL */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TSL_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.TSL */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_TSL_OFF (30)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_OFF (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_OFF (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_OFF (31)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_OFF (29)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMT_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_OFF (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDT_OFF (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_MLT_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_MLT_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_MLT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_OFF (31)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_SEN_LEN (1)

