HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_SEN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_SEN_OFF (29)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_SNU_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_SNU_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_SNU_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_TEN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_TEN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_TEN_OFF (30)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_TNU_LEN (9)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_TNU_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_TNU_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMS_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDS_OFF (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_OFF (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_RMO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_RMO_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_RMO_OFF (31)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_SEN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_SEN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_SEN_OFF (29)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_SNU_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_SNU_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_SNU_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_TEN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_TEN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_TEN_OFF (30)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_TNU_LEN (9)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_TNU_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_TNU_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_OFF (30)

