HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SGE1_OFF (5)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SGE2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SGE2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SGE2_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SMC_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SMC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SMC_OFF (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SSL_LEN (2)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SSL_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SSL_OFF (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SWR_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SWR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SWR_OFF (23)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYN_NS_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYN_NS_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYN_NS_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYN_NT_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYN_NT_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYN_NT_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYSF_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYSF_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SYSF_OFF (24)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TS0_HRS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TS0_HRS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TS0_HRS_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TS0_HRT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TS0_HRT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TS0_HRT_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TSL */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TSL_LEN (2)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TSL */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TSL_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.TSL */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_TSL_OFF (30)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SMC_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SMC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SMC_OFF (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SSL_LEN (2)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SSL_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SSL_OFF (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_OFF (23)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_OFF (24)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRT_LEN (1)

