HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH2_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH3_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH4_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH5_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH6_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH7_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_MSK (0x1)

