HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MEM_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MEM_ERR_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MEM_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MEM_ERR_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MEM_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MEM_ERR_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_LEN (14)

/** \\brief  Mask for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_MSK (0x3fff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CTRG_TRG0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CTRG_TRG0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CTRG_TRG0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CTRG_TRG10_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CTRG_TRG10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CTRG_TRG10_OFF (10)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CTRG_TRG11_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CTRG_TRG11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CTRG_TRG11_OFF (11)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CTRG_TRG12_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CTRG_TRG12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CTRG_TRG12_OFF (12)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CTRG_TRG13_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CTRG_TRG13_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CTRG_TRG13_OFF (13)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CTRG_TRG14_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CTRG_TRG14_MSK (0x1)

