HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CTRG_TRG14_OFF (14)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CTRG_TRG15_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CTRG_TRG15_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CTRG_TRG15_OFF (15)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CTRG_TRG1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CTRG_TRG1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CTRG_TRG1_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CTRG_TRG2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CTRG_TRG2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CTRG_TRG2_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CTRG_TRG3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CTRG_TRG3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CTRG_TRG3_OFF (3)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CTRG_TRG4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CTRG_TRG4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CTRG_TRG4_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CTRG_TRG5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CTRG_TRG5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CTRG_TRG5_OFF (5)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CTRG_TRG6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CTRG_TRG6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CTRG_TRG6_OFF (6)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CTRG_TRG7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CTRG_TRG7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CTRG_TRG7_OFF (7)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CTRG_TRG8_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CTRG_TRG8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CTRG_TRG8_OFF (8)

/** \\brief  Length for Ifx_GTM_MCS_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CTRG_TRG9_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CTRG_TRG9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CTRG_TRG9_OFF (9)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_OFF (16)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_OFF (3)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_OFF (5)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_OFF (6)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_OFF (7)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_OFF (8)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_OFF (9)

