HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_STRG_TRG12_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_STRG_TRG12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_STRG_TRG12_OFF (12)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_STRG_TRG13_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_STRG_TRG13_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_STRG_TRG13_OFF (13)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_STRG_TRG14_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_STRG_TRG14_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_STRG_TRG14_OFF (14)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_STRG_TRG15_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_STRG_TRG15_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_STRG_TRG15_OFF (15)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_STRG_TRG1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_STRG_TRG1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_STRG_TRG1_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_STRG_TRG2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_STRG_TRG2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_STRG_TRG2_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_STRG_TRG3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_STRG_TRG3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_STRG_TRG3_OFF (3)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_STRG_TRG4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_STRG_TRG4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_STRG_TRG4_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_STRG_TRG5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_STRG_TRG5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_STRG_TRG5_OFF (5)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_STRG_TRG6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_STRG_TRG6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_STRG_TRG6_OFF (6)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_STRG_TRG7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_STRG_TRG7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_STRG_TRG7_OFF (7)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_STRG_TRG8_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_STRG_TRG8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_STRG_TRG8_OFF (8)

/** \\brief  Length for Ifx_GTM_MCS_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_STRG_TRG9_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_STRG_TRG9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_STRG_TRG9_OFF (9)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_OFF (0)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_OFF (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_OFF (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_OFF (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_OFF (4)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_OFF (5)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_OFF (6)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_LEN (1)

