HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX4 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX4_OFF (12)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_OFF (16)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_OFF (20)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_OFF (21)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_OFF (22)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_OFF (23)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL0 */
#define IFX_GTM_MSCIN_INHCON_SEL0_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL0 */
#define IFX_GTM_MSCIN_INHCON_SEL0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL0 */
#define IFX_GTM_MSCIN_INHCON_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL10 */
#define IFX_GTM_MSCIN_INHCON_SEL10_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL10 */
#define IFX_GTM_MSCIN_INHCON_SEL10_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL10 */
#define IFX_GTM_MSCIN_INHCON_SEL10_OFF (20)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL11 */
#define IFX_GTM_MSCIN_INHCON_SEL11_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL11 */
#define IFX_GTM_MSCIN_INHCON_SEL11_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL11 */
#define IFX_GTM_MSCIN_INHCON_SEL11_OFF (22)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL12 */
#define IFX_GTM_MSCIN_INHCON_SEL12_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL12 */
#define IFX_GTM_MSCIN_INHCON_SEL12_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL12 */
#define IFX_GTM_MSCIN_INHCON_SEL12_OFF (24)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL13 */
#define IFX_GTM_MSCIN_INHCON_SEL13_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL13 */
#define IFX_GTM_MSCIN_INHCON_SEL13_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL13 */
#define IFX_GTM_MSCIN_INHCON_SEL13_OFF (26)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL14 */
#define IFX_GTM_MSCIN_INHCON_SEL14_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL14 */
#define IFX_GTM_MSCIN_INHCON_SEL14_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL14 */
#define IFX_GTM_MSCIN_INHCON_SEL14_OFF (28)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL15 */
#define IFX_GTM_MSCIN_INHCON_SEL15_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL15 */
#define IFX_GTM_MSCIN_INHCON_SEL15_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL15 */
#define IFX_GTM_MSCIN_INHCON_SEL15_OFF (30)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL1 */
#define IFX_GTM_MSCIN_INHCON_SEL1_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL1 */
#define IFX_GTM_MSCIN_INHCON_SEL1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL1 */
#define IFX_GTM_MSCIN_INHCON_SEL1_OFF (2)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL2 */
#define IFX_GTM_MSCIN_INHCON_SEL2_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL2 */
#define IFX_GTM_MSCIN_INHCON_SEL2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL2 */
#define IFX_GTM_MSCIN_INHCON_SEL2_OFF (4)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL3 */
#define IFX_GTM_MSCIN_INHCON_SEL3_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL3 */
#define IFX_GTM_MSCIN_INHCON_SEL3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL3 */
#define IFX_GTM_MSCIN_INHCON_SEL3_OFF (6)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL4 */
#define IFX_GTM_MSCIN_INHCON_SEL4_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL4 */
#define IFX_GTM_MSCIN_INHCON_SEL4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL4 */
#define IFX_GTM_MSCIN_INHCON_SEL4_OFF (8)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL5 */
#define IFX_GTM_MSCIN_INHCON_SEL5_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL5 */
#define IFX_GTM_MSCIN_INHCON_SEL5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL5 */
#define IFX_GTM_MSCIN_INHCON_SEL5_OFF (10)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INHCON_SEL6_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INHCON_SEL6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INHCON_SEL6_OFF (12)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INHCON_SEL7_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INHCON_SEL7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INHCON_SEL7_OFF (14)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INHCON_SEL8_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INHCON_SEL8_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INHCON_SEL8_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INHCON_SEL9_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INHCON_SEL9_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INHCON_SEL9_OFF (18)

