HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL5 */
#define IFX_GTM_MSCSET_CON1_SEL5_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL5 */
#define IFX_GTM_MSCSET_CON1_SEL5_OFF (8)

/** \\brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_OFF (24)

/** \\brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_OFF (24)

/** \\brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_OFF (0)

/** \\brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_OFF (8)

/** \\brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_OFF (0)

/** \\brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL13 */
#define IFX_GTM_MSCSET_CON3_SEL13_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL13 */
#define IFX_GTM_MSCSET_CON3_SEL13_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL13 */
#define IFX_GTM_MSCSET_CON3_SEL13_OFF (8)

/** \\brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL14 */
#define IFX_GTM_MSCSET_CON3_SEL14_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL14 */
#define IFX_GTM_MSCSET_CON3_SEL14_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL14 */
#define IFX_GTM_MSCSET_CON3_SEL14_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL15 */
#define IFX_GTM_MSCSET_CON3_SEL15_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL15 */
#define IFX_GTM_MSCSET_CON3_SEL15_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL15 */
#define IFX_GTM_MSCSET_CON3_SEL15_OFF (24)

/** \\brief  Length for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_OFF (0)

/** \\brief  Length for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_OFF (1)

/** \\brief  Length for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_LEN (2)

/** \\brief  Mask for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_OFF (28)

/** \\brief  Length for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_LEN (27)

/** \\brief  Mask for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_MSK (0x7ffffff)

/** \\brief  Offset for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_OFF (0)

/** \\brief  Length for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_LEN (24)

/** \\brief  Mask for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_OFF (0)

/** \\brief  Length for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_OFF (28)

/** \\brief  Length for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_LEN (24)

/** \\brief  Mask for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_OFF (0)

/** \\brief  Length for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_OFF (28)

