HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.CNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_CNTOFL_OFF (2)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_OFF (1)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_OFF (5)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPRzOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPRZOFL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPRzOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPRZOFL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPRzOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPRZOFL_OFF (3)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_OFF (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_OFF (4)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDU_Bits.TCS */
#define IFX_GTM_TIM_CH_TDU_TCS_LEN (3)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDU_Bits.TCS */
#define IFX_GTM_TIM_CH_TDU_TCS_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDU_Bits.TCS */
#define IFX_GTM_TIM_CH_TDU_TCS_OFF (1)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDU_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDU_TO_CNT_LEN (8)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDU_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDU_TO_CNT_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDU_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDU_TO_CNT_OFF (16)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDU_Bits.TO_EN */
#define IFX_GTM_TIM_CH_TDU_TO_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDU_Bits.TO_EN */
#define IFX_GTM_TIM_CH_TDU_TO_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDU_Bits.TO_EN */
#define IFX_GTM_TIM_CH_TDU_TO_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDU_Bits.TOV */
#define IFX_GTM_TIM_CH_TDU_TOV_LEN (8)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDU_Bits.TOV */
#define IFX_GTM_TIM_CH_TDU_TOV_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDU_Bits.TOV */
#define IFX_GTM_TIM_CH_TDU_TOV_OFF (8)

/** \\brief  Length for Ifx_GTM_TIM_RST_Bits.RST_CH0 */
#define IFX_GTM_TIM_RST_RST_CH0_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_RST_Bits.RST_CH0 */
#define IFX_GTM_TIM_RST_RST_CH0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_RST_Bits.RST_CH0 */
#define IFX_GTM_TIM_RST_RST_CH0_OFF (0)

/** \\brief  Length for Ifx_GTM_TIM_RST_Bits.RST_CH1 */
#define IFX_GTM_TIM_RST_RST_CH1_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_RST_Bits.RST_CH1 */
#define IFX_GTM_TIM_RST_RST_CH1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_RST_Bits.RST_CH1 */
#define IFX_GTM_TIM_RST_RST_CH1_OFF (1)

/** \\brief  Length for Ifx_GTM_TIM_RST_Bits.RST_CH2 */
#define IFX_GTM_TIM_RST_RST_CH2_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_RST_Bits.RST_CH2 */
#define IFX_GTM_TIM_RST_RST_CH2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_RST_Bits.RST_CH2 */
#define IFX_GTM_TIM_RST_RST_CH2_OFF (2)

/** \\brief  Length for Ifx_GTM_TIM_RST_Bits.RST_CH3 */
#define IFX_GTM_TIM_RST_RST_CH3_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_RST_Bits.RST_CH3 */
#define IFX_GTM_TIM_RST_RST_CH3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_RST_Bits.RST_CH3 */
#define IFX_GTM_TIM_RST_RST_CH3_OFF (3)

/** \\brief  Length for Ifx_GTM_TIM_RST_Bits.RST_CH4 */
#define IFX_GTM_TIM_RST_RST_CH4_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_RST_Bits.RST_CH4 */
#define IFX_GTM_TIM_RST_RST_CH4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_RST_Bits.RST_CH4 */
#define IFX_GTM_TIM_RST_RST_CH4_OFF (4)

/** \\brief  Length for Ifx_GTM_TIM_RST_Bits.RST_CH5 */
#define IFX_GTM_TIM_RST_RST_CH5_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_RST_Bits.RST_CH5 */
#define IFX_GTM_TIM_RST_RST_CH5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_RST_Bits.RST_CH5 */
#define IFX_GTM_TIM_RST_RST_CH5_OFF (5)

/** \\brief  Length for Ifx_GTM_TIM_RST_Bits.RST_CH6 */
#define IFX_GTM_TIM_RST_RST_CH6_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_RST_Bits.RST_CH6 */
#define IFX_GTM_TIM_RST_RST_CH6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_RST_Bits.RST_CH6 */
#define IFX_GTM_TIM_RST_RST_CH6_OFF (6)

/** \\brief  Length for Ifx_GTM_TIM_RST_Bits.RST_CH7 */
#define IFX_GTM_TIM_RST_RST_CH7_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_RST_Bits.RST_CH7 */
#define IFX_GTM_TIM_RST_RST_CH7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_RST_Bits.RST_CH7 */
#define IFX_GTM_TIM_RST_RST_CH7_OFF (7)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH15_CM0_CM0_LEN (16)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH15_CM0_CM0_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH15_CM0_CM0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH15_CM1_CM1_LEN (16)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH15_CM1_CM1_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH15_CM1_CM1_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CN0_Bits.CN0 */
#define IFX_GTM_TOM_CH15_CN0_CN0_LEN (16)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CN0_Bits.CN0 */
#define IFX_GTM_TOM_CH15_CN0_CN0_MSK (0xffff)

