HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_TOM_CH15_CN0_Bits.CN0 */
#define IFX_GTM_TOM_CH15_CN0_CN0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CTRL_Bits.BITREV */
#define IFX_GTM_TOM_CH15_CTRL_BITREV_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CTRL_Bits.BITREV */
#define IFX_GTM_TOM_CH15_CTRL_BITREV_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_CTRL_Bits.BITREV */
#define IFX_GTM_TOM_CH15_CTRL_BITREV_OFF (27)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_TOM_CH15_CTRL_CLK_SRC_SR_LEN (3)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_TOM_CH15_CTRL_CLK_SRC_SR_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_TOM_CH15_CTRL_CLK_SRC_SR_OFF (12)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CTRL_Bits.OSM */
#define IFX_GTM_TOM_CH15_CTRL_OSM_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CTRL_Bits.OSM */
#define IFX_GTM_TOM_CH15_CTRL_OSM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_CTRL_Bits.OSM */
#define IFX_GTM_TOM_CH15_CTRL_OSM_OFF (26)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_TOM_CH15_CTRL_RST_CCU0_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_TOM_CH15_CTRL_RST_CCU0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_TOM_CH15_CTRL_RST_CCU0_OFF (20)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CTRL_Bits.SL */
#define IFX_GTM_TOM_CH15_CTRL_SL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CTRL_Bits.SL */
#define IFX_GTM_TOM_CH15_CTRL_SL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_CTRL_Bits.SL */
#define IFX_GTM_TOM_CH15_CTRL_SL_OFF (11)

/** \\brief  Length for Ifx_GTM_TOM_CH15_CTRL_Bits.TRIGOUT */
#define IFX_GTM_TOM_CH15_CTRL_TRIGOUT_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_CTRL_Bits.TRIGOUT */
#define IFX_GTM_TOM_CH15_CTRL_TRIGOUT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_CTRL_Bits.TRIGOUT */
#define IFX_GTM_TOM_CH15_CTRL_TRIGOUT_OFF (24)

/** \\brief  Length for Ifx_GTM_TOM_CH15_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_TOM_CH15_IRQ_EN_CCU0TC_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_TOM_CH15_IRQ_EN_CCU0TC_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_TOM_CH15_IRQ_EN_CCU0TC_IRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_TOM_CH15_IRQ_EN_CCU1TC_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_TOM_CH15_IRQ_EN_CCU1TC_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_TOM_CH15_IRQ_EN_CCU1TC_IRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_TOM_CH15_IRQ_FORCINT_Bits.TRG_CCU0TC0 */
#define IFX_GTM_TOM_CH15_IRQ_FORCINT_TRG_CCU0TC0_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_IRQ_FORCINT_Bits.TRG_CCU0TC0 */
#define IFX_GTM_TOM_CH15_IRQ_FORCINT_TRG_CCU0TC0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_IRQ_FORCINT_Bits.TRG_CCU0TC0 */
#define IFX_GTM_TOM_CH15_IRQ_FORCINT_TRG_CCU0TC0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_IRQ_FORCINT_Bits.TRG_CCU1TC0 */
#define IFX_GTM_TOM_CH15_IRQ_FORCINT_TRG_CCU1TC0_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_IRQ_FORCINT_Bits.TRG_CCU1TC0 */
#define IFX_GTM_TOM_CH15_IRQ_FORCINT_TRG_CCU1TC0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_IRQ_FORCINT_Bits.TRG_CCU1TC0 */
#define IFX_GTM_TOM_CH15_IRQ_FORCINT_TRG_CCU1TC0_OFF (1)

/** \\brief  Length for Ifx_GTM_TOM_CH15_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TOM_CH15_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TOM_CH15_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TOM_CH15_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_TOM_CH15_IRQ_NOTIFY_CCU0TC_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_TOM_CH15_IRQ_NOTIFY_CCU0TC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_TOM_CH15_IRQ_NOTIFY_CCU0TC_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_TOM_CH15_IRQ_NOTIFY_CCU1TC_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_TOM_CH15_IRQ_NOTIFY_CCU1TC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_TOM_CH15_IRQ_NOTIFY_CCU1TC_OFF (1)

/** \\brief  Length for Ifx_GTM_TOM_CH15_SR0_Bits.SR0 */
#define IFX_GTM_TOM_CH15_SR0_SR0_LEN (16)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_SR0_Bits.SR0 */
#define IFX_GTM_TOM_CH15_SR0_SR0_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_SR0_Bits.SR0 */
#define IFX_GTM_TOM_CH15_SR0_SR0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_SR1_Bits.SR1 */
#define IFX_GTM_TOM_CH15_SR1_SR1_LEN (16)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_SR1_Bits.SR1 */
#define IFX_GTM_TOM_CH15_SR1_SR1_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_SR1_Bits.SR1 */
#define IFX_GTM_TOM_CH15_SR1_SR1_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH15_STAT_Bits.OL */
#define IFX_GTM_TOM_CH15_STAT_OL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH15_STAT_Bits.OL */
#define IFX_GTM_TOM_CH15_STAT_OL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH15_STAT_Bits.OL */
#define IFX_GTM_TOM_CH15_STAT_OL_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH_CM0_CM0_LEN (16)

/** \\brief  Mask for Ifx_GTM_TOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH_CM0_CM0_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_TOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH_CM0_CM0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH_CM1_CM1_LEN (16)

/** \\brief  Mask for Ifx_GTM_TOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH_CM1_CM1_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_TOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH_CM1_CM1_OFF (0)

