HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT4_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT4_OFF (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT5_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT5_OFF (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT6_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT6_OFF (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT7_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT7_OFF (14)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGTM_BF_H */
